dossier-conception/02-uml/cas-utilisation.puml
@startuml
left to right direction
skinparam packageStyle rectangle
skinparam shadowing false
skinparam actorStyle stickman

actor "Coworker" as A1
actor "Référent Société" as A2
actor "Hôte d'accueil" as A3
actor "Gérant" as A4
actor "Animateur Atelier" as A5

actor "PSP (Paiement)" as A6 <<System>>
actor "Service E-mail" as A7 <<System>>
actor "Planificateur (Temps)" as A8 <<Time>>

A2 -|> A1 : généralise

rectangle "Plateforme CoWork'In" {
  usecase "UC-01: Réserver un poste" as UC1
  usecase "UC-02: Réserver une salle de réunion" as UC2
  usecase "UC-03: S'inscrire à un atelier" as UC3
  usecase "UC-04: Annuler une réservation" as UC4
  usecase "UC-05: Consulter le registre de présence" as UC5
  usecase "UC-06: Mettre une salle en maintenance" as UC6
  usecase "UC-07: Consulter le TdB d'occupation" as UC7
  usecase "UC-08: Générer les factures mensuelles" as UC8

  usecase "UC-09: S'authentifier" as UC_Auth
  usecase "UC-10: Vérifier disponibilité" as UC_Dispo
  usecase "UC-11: Payer le complément" as UC_Pay

  UC1 ..> UC_Auth : <<include>>
  UC1 ..> UC_Dispo : <<include>>

  UC2 ..> UC_Auth : <<include>>
  UC2 ..> UC_Dispo : <<include>>
  UC_Pay .> UC2 : <<extend>> (Quota dépassé / non-abonné)

  UC3 ..> UC_Auth : <<include>>

  UC4 ..> UC_Auth : <<include>>
}

A1 --> UC1
A1 --> UC2
A1 --> UC3
A1 --> UC4

A3 --> UC5
A3 --> UC6

A4 --> UC7

A5 --> UC3

A8 --> UC8

UC_Pay --> A6
UC1 --> A7
UC2 --> A7
UC3 --> A7
UC8 --> A7

@enduml
